; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob68) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 - Pallet
	crate0 crate1 crate2 crate3 crate4 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate0)
	(at pallet2 depot2)
	(clear crate4)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate3)
	(at pallet5 distributor2)
	(clear crate2)
	(at pallet6 depot2)
	(clear crate1)
	(at pallet7 depot1)
	(clear pallet7)
	(at pallet8 depot2)
	(clear pallet8)
	(at pallet9 depot2)
	(clear pallet9)
	(at pallet10 distributor1)
	(clear pallet10)
	(at truck0 depot2)
	(at truck1 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor2)
	(available hoist9)
	(at hoist10 depot1)
	(available hoist10)
	(at hoist11 distributor1)
	(available hoist11)
	(at crate0 depot1)
	(on crate0 pallet1)
	(at crate1 depot2)
	(on crate1 pallet6)
	(at crate2 distributor2)
	(on crate2 pallet5)
	(at crate3 distributor1)
	(on crate3 pallet4)
	(at crate4 depot2)
	(on crate4 pallet2)
)

(:goal (and
		(on crate0 pallet2)
		(on crate1 pallet0)
		(on crate2 pallet1)
		(on crate3 pallet10)
		(on crate4 crate2)
	)
))

; plan
1. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 0 of 5
2. (lift hoist4 crate3 pallet4 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 pallet4)
   added: (lifting hoist4 crate3) (clear pallet4)
   goals met: 0 of 5
3. (drop hoist4 crate3 pallet10 distributor1)
   deleted: (lifting hoist4 crate3) (clear pallet10)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 pallet10)
   goals met: 1 of 5
4. (lift hoist10 crate0 pallet1 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist10) (on crate0 pallet1)
   added: (lifting hoist10 crate0) (clear pallet1)
   goals met: 1 of 5
5. (load hoist10 crate0 truck1 depot1)
   deleted: (lifting hoist10 crate0)
   added: (in crate0 truck1) (available hoist10)
   goals met: 1 of 5
6. (drive truck1 depot1 depot2)
   deleted: (at truck1 depot1)
   added: (at truck1 depot2)
   goals met: 1 of 5
7. (unload hoist6 crate0 truck1 depot2)
   deleted: (in crate0 truck1) (available hoist6)
   added: (lifting hoist6 crate0)
   goals met: 1 of 5
8. (lift hoist2 crate4 pallet2 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist2) (on crate4 pallet2)
   added: (lifting hoist2 crate4) (clear pallet2)
   goals met: 1 of 5
9. (load hoist2 crate4 truck0 depot2)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   goals met: 1 of 5
10. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 1 of 5
11. (unload hoist9 crate4 truck0 distributor2)
   deleted: (in crate4 truck0) (available hoist9)
   added: (lifting hoist9 crate4)
   goals met: 1 of 5
12. (drop hoist6 crate0 pallet2 depot2)
   deleted: (lifting hoist6 crate0) (clear pallet2)
   added: (available hoist6) (at crate0 depot2) (clear crate0) (on crate0 pallet2)
   goals met: 2 of 5
13. (lift hoist6 crate1 pallet6 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist6) (on crate1 pallet6)
   added: (lifting hoist6 crate1) (clear pallet6)
   goals met: 2 of 5
14. (load hoist6 crate1 truck1 depot2)
   deleted: (lifting hoist6 crate1)
   added: (in crate1 truck1) (available hoist6)
   goals met: 2 of 5
15. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 2 of 5
16. (unload hoist7 crate1 truck1 depot0)
   deleted: (in crate1 truck1) (available hoist7)
   added: (lifting hoist7 crate1)
   goals met: 2 of 5
17. (drop hoist7 crate1 pallet0 depot0)
   deleted: (lifting hoist7 crate1) (clear pallet0)
   added: (available hoist7) (at crate1 depot0) (clear crate1) (on crate1 pallet0)
   goals met: 3 of 5
18. (lift hoist5 crate2 pallet5 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 pallet5)
   added: (lifting hoist5 crate2) (clear pallet5)
   goals met: 3 of 5
19. (load hoist5 crate2 truck0 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   goals met: 3 of 5
20. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 3 of 5
21. (unload hoist10 crate2 truck0 depot1)
   deleted: (in crate2 truck0) (available hoist10)
   added: (lifting hoist10 crate2)
   goals met: 3 of 5
22. (drop hoist10 crate2 pallet1 depot1)
   deleted: (lifting hoist10 crate2) (clear pallet1)
   added: (available hoist10) (at crate2 depot1) (clear crate2) (on crate2 pallet1)
   goals met: 4 of 5
23. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   goals met: 4 of 5
24. (load hoist9 crate4 truck0 distributor2)
   deleted: (lifting hoist9 crate4)
   added: (in crate4 truck0) (available hoist9)
   goals met: 4 of 5
25. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 4 of 5
26. (unload hoist10 crate4 truck0 depot1)
   deleted: (in crate4 truck0) (available hoist10)
   added: (lifting hoist10 crate4)
   goals met: 4 of 5
27. (drop hoist10 crate4 crate2 depot1)
   deleted: (lifting hoist10 crate4) (clear crate2)
   added: (available hoist10) (at crate4 depot1) (clear crate4) (on crate4 crate2)
   goals met: 5 of 5
